{
  "education": [
    {
      "awards_achievements": [
        "Scholarship",
        "Dean's List (2015, 2016): Ut enim ad minim veniam",
        "GPA: 3.8/4.0"
      ],
      "degree": "Bachelor of Applied Sciences",
      "department": "Electrical and Computer Engineering",
      "duration": "2012-2016",
      "school_name": "XYZ university"
    },
    {
      "awards_achievements": null,
      "degree": "Master of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2016-2018",
      "school_name": "XYZ university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_LamineDjobo",
  "highlighted_projects": [
    {
      "description": "Worked on the development of a mobile application called 'Dors-tu-bébé,' designed to generate and narrate personalized bedtime stories for young children. Utilized the OpenAI/ChatGPT API to create dynamic story content and integrated OpenAI's voice function for narration. Developed the application using Kotlin/Java, with Firebase for backend services and MongoDB for data storage, all within the Android Studio environment. This project highlights skills in mobile app development, API integration, and cloud-based database management",
      "name": "Dors-tu-bébé"
    },
    {
      "description": "Built a dynamic e-commerce website using Vue.js for the frontend, offering a responsive and user-friendly shopping experience. Implemented a comprehensive cart system allowing users to manage their selections efficiently. Integrated PayPal API for secure and seamless payment processing. Managed the backend with SQL database for reliable storage and retrieval of product and user data. This project demonstrates proficiency in modern web development and database management.",
      "name": "E-commerce website"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux-based monitoring tool to track and manage server performance across a cluster. Implemented in Bash and SQL, this tool automates the collection of hardware specifications and resource usage data, storing the information in a PostgreSQL database. Leveraged cron jobs for scheduled monitoring and real-time alerts. Utilized Git for version control and collaboration, ensuring efficient project management and deployment. This project showcases expertise in shell scripting and database integration within a Linux environment.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Lamine Djobo",
  "others": [
    {
      "bullets": [
        "Udacity Machine Learning (2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming",
        "Volunteer, ABC Food bank: Ut enim ad minim veniam"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "XYZ Company",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2019",
      "title": "Tutor"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "MongoDb",
      "HTML/CSS",
      "React Native",
      "Expo"
    ],
    "familiar": [
      "Node.js",
      "Express.js",
      "Typescript",
      "Azure",
      "Figma"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I'm a professional with 6 years\\' solid experience in banking as a financial advisor. My passion for IT was born at a very young age and has stayed with me to this day. While working at the bank, I constantly identified areas for improvement in my work tools. The desire to create and enhance the tools used by software and application users led me to transition my career focus. My goal is to become a full-stack developer.During my intensive technical diploma (AEC) in web and mobile application development, I collaborated on the creation of a mobile application called \"Dors-tu bébé\". This application generates stories for young children using the OpenAI/ChatGPT API and allows them to be narrated using OpenAI's voice function. It was developed using Kotlin/Java, Firebase, and MongoDB, all within Android Studio.This experience has only heightened my thirst for knowledge and discovery. It drives me to continuously learn and improve in the IT field. My ambition is to become an excellent developer, capable of actively contributing to the advancement of technologies."
}
